Repository: CofficLab/Lumi
Catalog: Plugins/EditorSwiftPlugin/Sources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: cursors
zh_hans: 个光标
zh_hk: 個游標

source: '%@' does not belong to any compilation target.
zh_hans: '%@' 不属于任何编译目标。
zh_hk: '%@' 不屬於任何編譯目標。

source: "%@" is not bound to any compilation target. Cross-file semantic navigation may be unavailable.
zh_hans: "%@" 未绑定到任何编译目标。跨文件语义导航可能不可用。
zh_hk: "%@" 未綁定到任何編譯目標。跨文件語義導航可能不可用。

# %d rows × %d columns
source: %1$d rows × %2$d columns
zh_hans: %1$d 行 × %2$d 列
zh_hk: %1$d 列 × %2$d 欄

source: %lld items
zh_hans: %lld 项
zh_hk: %lld 項

# %lld matches in %lld files
source: %1$lld matches in %2$lld files
zh_hans: %lld 个匹配，在 %lld 个文件中
zh_hk: %lld 個匹配，在 %lld 個檔案中

source: 2 Spaces
zh_hans: 2 个空格
zh_hk: 2 個空格

source: 4 Spaces
zh_hans: 4 个空格
zh_hk: 4 個空格

source: 8 Spaces
zh_hans: 8 个空格
zh_hk: 8 個空格

source: A
zh_hans: 字号
zh_hk: 字號

source: Add Location to Chat
zh_hans: 添加位置到对话
zh_hk: 添加位置到對話

source: Add Next Occurrence
zh_hans: 添加下一个匹配项
zh_hk: 添加下一個匹配項

source: Add Selection to Chat
zh_hans: 添加选中内容到对话
zh_hk: 添加選中內容到對話

source: Add to Conversation
zh_hans: 添加到对话
zh_hk: 加入對話

source: All
zh_hans: 全部
zh_hk: 全部

source: Apply Rename
zh_hans: 应用重命名
zh_hk: 套用重命名

source: Are you sure you want to delete "%@"?
zh_hans: 确定要删除 "%@" 吗？
zh_hk: 確定要刪除 "%@" 嗎？

source: Automation: start preview stream
zh_hans: 自动化测试：启动预览流
zh_hk: 自動化測試：啟動預覽串流

source: Automation: stop preview stream
zh_hans: 自动化测试：停止预览流
zh_hk: 自動化測試：停止預覽串流

source: Available
zh_hans: 可用
zh_hk: 可用

source: Available (scheme: %@)
zh_hans: 可用（scheme: %@）
zh_hk: 可用（scheme: %@）

source: Breadcrumb Navigation
zh_hans: 面包屑导航
zh_hk: 麵包屑導航

source: Build
zh_hans: 构建
zh_hk: 構建

source: Build Context
zh_hans: 构建上下文
zh_hk: 構建上下文

source: Build Context Needs Sync
zh_hans: 构建上下文需要同步
zh_hk: 構建上下文需要同步

source: Build Context Unavailable
zh_hans: 构建上下文不可用
zh_hk: 構建上下文不可用

source: Build log saved:
zh_hans: 构建日志已保存至：
zh_hk: 建置日誌已儲存至：

source: Build succeeded
zh_hans: 构建成功
zh_hk: 構建成功

source: building %@
zh_hans: 构建中 %@
zh_hk: 建置中 %@

source: cache
zh_hans: 缓存
zh_hk: 快取

source: Call Hierarchy
zh_hans: 调用层次
zh_hk: 調用層次

source: Call Hierarchy (%lld)
zh_hans: 调用层次 (%lld)
zh_hk: 調用層次 (%lld)

source: Call Hierarchy panel in the editor bottom area
zh_hans: 编辑器底部的调用层次面板
zh_hk: 編輯器底部的調用層次面板

source: Cancel
zh_hans: 取消
zh_hk: 取消

source: Case Sensitive
zh_hans: 区分大小写
zh_hk: 區分大小寫

source: Choose which #Preview in the current Swift file to build and render.
zh_hans: 选择当前 Swift 文件中要构建和渲染的 #Preview。
zh_hk: 選擇目前 Swift 檔案中要建置和算繪的 #Preview。

source: Clear Additional Cursors
zh_hans: 清除额外光标
zh_hk: 清除額外游標

source: Clear Inline Preview build cache
zh_hans: 清理预览构建缓存
zh_hk: 清理內嵌預覽建置快取

source: Close
zh_hans: 关闭
zh_hk: 關閉

source: Close Others
zh_hans: 关闭其他
zh_hk: 關閉其他

source: Close Split Editor
zh_hans: 关闭分栏编辑器
zh_hk: 關閉分欄編輯器

source: Close Tab
zh_hans: 关闭标签页
zh_hk: 關閉分頁

source: Close Tabs to the Left
zh_hans: 关闭左侧所有
zh_hk: 關閉左側所有

source: Close Tabs to the Right
zh_hans: 关闭右侧所有
zh_hk: 關閉右側所有

source: Code Editor
zh_hans: 代码编辑器
zh_hk: 代碼編輯器

source: Code editor with file tree
zh_hans: 带文件树的代码编辑器
zh_hk: 帶檔案樹的代碼編輯器

source: Command Palette
zh_hans: 命令面板
zh_hk: 命令面板

source: Compilation failed
zh_hans: 编译失败
zh_hk: 編譯失敗

source: Config
zh_hans: 配置
zh_hk: 配置

source: Configuration
zh_hans: 配置
zh_hk: 配置

source: Copy Line Down
zh_hans: 向下复制行
zh_hk: 向下複製行

source: Copy Line Up
zh_hans: 向上复制行
zh_hk: 向上複製行

source: Copy Path
zh_hans: 复制路径
zh_hk: 複製路徑

source: Create
zh_hans: 创建
zh_hk: 建立

source: CSV Preview
zh_hans: CSV 预览
zh_hk: CSV 預覽

source: Current File
zh_hans: 当前文件
zh_hk: 當前文件

source: Current file belongs to %@, but current scheme cannot uniquely determine semantic context.
zh_hans: 当前文件属于 %@，但当前 scheme 无法唯一确定语义上下文。
zh_hk: 當前文件屬於 %@，但當前 scheme 無法唯一確定語義上下文。

source: Current file belongs to multiple targets (%1$@); semantic results depend on current scheme and configuration.
zh_hans: 当前文件属于多个目标（%1$@）；语义结果取决于当前 scheme 和配置。
zh_hk: 當前檔案屬於多個目標（%1$@）；語義結果取決於當前 scheme 和配置。

source: Current file belongs to multiple targets; the editor is currently parsing with '%@' context.
zh_hans: 当前文件属于多个目标；编辑器当前正在使用 '%@' 上下文进行解析。
zh_hk: 當前檔案屬於多個目標；編輯器當前正在使用 '%@' 上下文進行解析。

# Current file belongs to target '%@', but current scheme '%@' may not cover it.
source: Current file belongs to target '%1$@', but current scheme '%2$@' may not cover it.
zh_hans: 当前文件属于目标 '%1$@'，但当前 scheme '%2$@' 可能不包含它。
zh_hk: 當前檔案屬於目標 '%1$@'，但當前 scheme '%2$@' 可能不包含它。

source: Current file is not bound to any build target, cross-file navigation and diagnostics may be unavailable.
zh_hans: 当前文件未绑定到任何编译 target，跨文件跳转和诊断可能不可用。
zh_hk: 當前文件未綁定到任何編譯 target，跨文件跳轉和診斷可能不可用。

source: Current file matches multiple targets, currently resolving with '%@'.
zh_hans: 当前文件匹配多个目标，当前使用 '%@' 解析。
zh_hk: 當前文件匹配多個目標，當前使用 '%@' 解析。

source: Current scheme '%@' does not include %@.
zh_hans: 当前 scheme '%@' 不包含 %@。
zh_hk: 當前 scheme '%@' 不包含 %@。

source: Current Symbol
zh_hans: 当前符号
zh_hk: 當前符號

source: Current symbol breadcrumb for the editor panel
zh_hans: 编辑器面板的当前符号面包屑导航
zh_hk: 編輯器面板的當前符號麵包屑導航

source: Current: %@
zh_hans: 当前：%@
zh_hk: 當前：%@

source: Cursor Document End
zh_hans: 光标到文档末尾
zh_hk: 游標到文檔末尾

source: Cursor Document Start
zh_hans: 光标到文档开头
zh_hk: 游標到文檔開頭

source: Cursor Line End
zh_hans: 光标到行尾
zh_hk: 游標到行尾

source: Cursor Line End Select
zh_hans: 选中到行尾
zh_hk: 選中到行尾

source: Cursor Paragraph Backward
zh_hans: 光标移到上一段落
zh_hk: 游標移到上一段落

source: Cursor Paragraph Forward
zh_hans: 光标移到下一段落
zh_hk: 游標移到下一段落

source: Cursor Smart Home
zh_hans: 光标智能 Home
zh_hk: 游標智能 Home

source: Cursor Smart Home Select
zh_hans: 选区智能 Home
zh_hk: 選區智能 Home

source: Cursor Word Left
zh_hans: 光标左移一个词
zh_hk: 游標左移一個詞

source: Cursor Word Left Select
zh_hans: 选区左移一个词
zh_hk: 選區左移一個詞

source: Cursor Word Right
zh_hans: 光标右移一个词
zh_hk: 游標右移一個詞

source: Cursor Word Right Select
zh_hans: 选区右移一个词
zh_hk: 選區右移一個詞

source: Default Localization
zh_hans: 默认本地化
zh_hk: 預設本地化

source: Default Localization (%@)
zh_hans: 默认本地化（%@）
zh_hk: 預設本地化（%@）

source: Delete Line
zh_hans: 删除行
zh_hk: 刪除行

source: Delete Word Left
zh_hans: 删除左侧单词
zh_hk: 刪除左側單詞

source: Delete Word Right
zh_hans: 删除右侧单词
zh_hk: 刪除右側單詞

source: Dependency planning failed
zh_hans: 依赖规划失败
zh_hk: 依賴規劃失敗

source: Destination
zh_hans: 目标平台
zh_hk: 目標平台

source: Destination Undetermined
zh_hans: 目标平台未确定
zh_hk: 目標平台未確定

source: Diagnostics
zh_hans: 诊断
zh_hk: 診斷

source: Editing disabled for truncated preview
zh_hans: 截断预览下编辑已禁用
zh_hk: 截斷預覽下編輯已禁用

source: Editing...
zh_hans: 编辑中...
zh_hk: 編輯中...

source: Editor Bottom Call Hierarchy
zh_hans: 编辑器底部调用层次
zh_hk: 編輯器底部調用層次

source: Editor Bottom Problems
zh_hans: 编辑器底部问题
zh_hk: 編輯器底部問題

source: Editor Bottom References
zh_hans: 编辑器底部引用
zh_hk: 編輯器底部引用

source: Editor Bottom Search
zh_hans: 编辑器底部搜索
zh_hk: 編輯器底部搜索

source: Editor Bottom Symbols
zh_hans: 编辑器底部符号
zh_hk: 編輯器底部符號

source: Editor Bottom Terminal
zh_hans: 编辑器底部终端
zh_hk: 編輯器底部終端

source: Editor Rail File Tree
zh_hans: 编辑器文件树侧栏
zh_hk: 編輯器檔案樹側邊欄

source: Editor sidebar explorer tab
zh_hans: 编辑器侧边栏文件浏览器标签
zh_hk: 編輯器側邊欄檔案瀏覽器標籤

source: Editor Sticky Symbol Bar
zh_hans: 编辑器符号面包屑栏
zh_hk: 編輯器符號麵包屑欄

source: Editor Tab Strip
zh_hans: 编辑器标签栏
zh_hk: 編輯器標籤欄

source: Embedded preview powered by LumiPreviewKit
zh_hans: 由 LumiPreviewKit 驱动的预览
zh_hk: 由 LumiPreviewKit 驅動的內嵌預覽

source: Empty
zh_hans: 空
zh_hk: 空

source: Empty CSV data
zh_hans: 空的 CSV 数据
zh_hk: 空的 CSV 資料

source: Empty folder
zh_hans: 空文件夹
zh_hk: 空資料夾

source: Empty workspace edit
zh_hans: 空的工作区编辑
zh_hk: 空的工作區編輯

source: Enter a new symbol name:
zh_hans: 输入新的符号名称：
zh_hk: 輸入新的符號名稱：

source: Enter a query and press Return
zh_hans: 输入搜索关键词并按回车
zh_hk: 輸入搜索關鍵詞並按回車

source: Enter the name for the new file.
zh_hans: 请输入新文件的名称。
zh_hk: 請輸入新檔案的名稱。

source: Enter the name for the new folder.
zh_hans: 请输入新文件夹的名称。
zh_hk: 請輸入新資料夾的名稱。

source: Enter the new name for this item.
zh_hans: 请输入新的名称。
zh_hk: 請輸入新的名稱。

source: entry · %@
zh_hans: 入口 · %@
zh_hk: 入口 · %@

source: Entry debug state
zh_hans: 入口调试状态
zh_hk: 入口除錯狀態

source: Error
zh_hans: 错误
zh_hk: 錯誤

source: Failed to capture preview screenshot.
zh_hans: 截取预览截图失败。
zh_hk: 擷取預覽截圖失敗。

source: Failed to load image: %@
zh_hans: 加载图片失败：%@
zh_hk: 載入圖片失敗：%@

source: Failed to load string catalog: %@
zh_hans: 加载字符串目录失败：%@
zh_hk: 載入字串目錄失敗：%@

source: Failed to save screenshot: %@
zh_hans: 保存截图失败：%@
zh_hk: 儲存截圖失敗：%@

source: failed: %@
zh_hans: 失败：%@
zh_hk: 失敗：%@

source: File name
zh_hans: 文件名
zh_hk: 檔案名稱

source: File not found: %@
zh_hans: 文件未找到：%@
zh_hk: 找不到檔案：%@

source: File Not in Target
zh_hans: 文件不在目标中
zh_hk: 文件不在目標中

source: File Not Registered in Project
zh_hans: 文件未在项目中注册
zh_hk: 文件未在項目中註冊

source: File path breadcrumb navigation below editor tabs
zh_hans: 在编辑器标签栏下方显示文件路径的面包屑导航
zh_hk: 在編輯器標籤欄下方顯示文件路徑的麵包屑導航

source: File too large. Preview is truncated.
zh_hans: 文件过大，预览已截断。
zh_hk: 文件過大，預覽已截斷。

source: Files
zh_hans: 文件
zh_hk: 檔案

source: Find
zh_hans: 查找
zh_hk: 查找

source: Find All References
zh_hans: 查找所有引用
zh_hk: 查找所有引用

source: Find Next
zh_hans: 查找下一个
zh_hk: 查找下一個

source: Find Previous
zh_hans: 查找上一个
zh_hk: 查找上一個

source: Finding declaration...
zh_hans: 正在查找声明...
zh_hk: 正在查找聲明...

source: Finding definition...
zh_hans: 正在查找定义...
zh_hk: 正在查找定義...

source: Finding implementation...
zh_hans: 正在查找实现...
zh_hk: 正在查找實現...

source: Finding references...
zh_hans: 正在查找引用...
zh_hk: 正在查找引用...

source: Finding type definition...
zh_hans: 正在查找类型定义...
zh_hk: 正在查找類型定義...

source: Fix All on Save
zh_hans: 保存时全部修复
zh_hk: 儲存時全部修復

source: Fold All
zh_hans: 全部折叠
zh_hk: 全部摺疊

source: Fold Current Block
zh_hans: 折叠当前代码块
zh_hk: 摺疊當前代碼塊

source: Fold Level 1
zh_hans: 折叠到第 1 层
zh_hk: 摺疊到第 1 層

source: Fold Level 2
zh_hans: 折叠到第 2 层
zh_hk: 摺疊到第 2 層

source: Folder name
zh_hans: 文件夹名
zh_hk: 資料夾名稱

source: folding
zh_hans: 折叠
zh_hk: 摺疊

source: Folding ribbon disabled
zh_hans: 折叠标记已禁用
zh_hk: 摺疊標記已禁用

source: Format Document
zh_hans: 格式化文档
zh_hk: 格式化文檔

source: Format on Save
zh_hans: 保存时格式化
zh_hk: 儲存時格式化

source: Found references:
zh_hans: 找到引用：
zh_hk: 找到引用：

source: Frequently Used
zh_hans: 常用
zh_hk: 常用

source: Go Build
zh_hans: Go 构建
zh_hk: Go 構建

source: Go Editor
zh_hans: Go 编辑器
zh_hk: Go 編輯器

source: Go Format
zh_hans: Go 格式化
zh_hk: Go 格式化

source: Go language support: gopls integration, build, test, format, and module management.
zh_hans: Go 语言支持：gopls 集成、构建、测试、格式化和模块管理。
zh_hk: Go 語言支援：gopls 整合、構建、測試、格式化和模組管理。

source: Go Mod Tidy
zh_hans: Go 依赖整理
zh_hk: Go 依賴整理

source: Go Test
zh_hans: Go 测试
zh_hk: Go 測試

source: Go to Symbol in Workspace
zh_hans: 跳转到工作区符号
zh_hk: 跳轉到工作區符號

source: Got It
zh_hans: 知道了
zh_hk: 知道了

source: HTML Preview
zh_hans: HTML 预览
zh_hk: HTML 預覽

source: Image Preview
zh_hans: 图片预览
zh_hk: 圖片預覽

source: In Selection
zh_hans: 在选区内
zh_hk: 在選區內

source: Incoming
zh_hans: 传入调用
zh_hk: 傳入調用

source: Indexing %d%%
zh_hans: 索引中 %d%%
zh_hk: 索引中 %d%%

source: Indexing...
zh_hans: 索引中...
zh_hk: 索引中...

source: inlay
zh_hans: 内联提示
zh_hk: 內聯提示

source: Inlay hints disabled
zh_hans: 内联提示已禁用
zh_hk: 內聯提示已禁用

source: Inline Preview
zh_hans: 预览
zh_hk: 內嵌預覽

source: Insert Final Newline
zh_hans: 插入末尾换行
zh_hk: 插入末尾換行

source: Insert Line Above
zh_hans: 在上方插入行
zh_hk: 在上方插入行

source: Insert Line Below
zh_hans: 在下方插入行
zh_hk: 在下方插入行

source: Invalid CSV
zh_hans: 无效的 CSV
zh_hk: 無效的 CSV

source: Invalid JSON
zh_hans: 无效的 JSON
zh_hk: 無效的 JSON

source: Invalid JSON data
zh_hans: 无效的 JSON 数据
zh_hk: 無效的 JSON 資料

source: Invalid plist
zh_hans: 无效的 plist
zh_hk: 無效的 plist

source: Invalid plist data
zh_hans: 无效的 plist 数据
zh_hk: 無效的 plist 資料

source: Invalid selection
zh_hans: 无效选区
zh_hk: 無效選區

source: JavaScript and TypeScript project support: package.json parsing, tsconfig resolution, and script execution.
zh_hans: JavaScript 和 TypeScript 项目支持：package.json 解析、tsconfig 路径映射和脚本执行。
zh_hk: JavaScript 和 TypeScript 項目支持：package.json 解析、tsconfig 路徑映射和腳本執行。

source: JS/TS Editor
zh_hans: JS/TS 编辑器
zh_hk: JS/TS 編輯器

source: JSON Preview
zh_hans: JSON 预览
zh_hk: JSON 預覽

source: Keep Editor Version
zh_hans: 保留编辑器版本
zh_hk: 保留編輯器版本

source: Key
zh_hans: 键
zh_hk: 鍵

source: Large File
zh_hans: 大文件
zh_hk: 大檔案

# Large File Read-Only Preview
source: Large file uses read-only preview mode for performance.
zh_hans: 大文件只读预览
zh_hk: 大文件只讀預覽

source: Ln %lld
zh_hans: 行 %lld
zh_hk: 行 %lld

source: Load Full File
zh_hans: 加载完整文件
zh_hk: 載入完整檔案

source: loading %@
zh_hans: 加载中 %@
zh_hk: 載入中 %@

source: Loading Call Hierarchy...
zh_hans: 正在加载调用层次…
zh_hk: 正在載入調用層次…

source: Loading...
zh_hans: 加载中...
zh_hk: 載入中...

source: long line
zh_hans: 超长行
zh_hk: 超長行

source: Long line: L%lld · %lld chars
zh_hans: 超长行：第 %lld 行 · %lld 个字符
zh_hk: 超長行：第 %lld 行 · %lld 個字符

source: long-line syntax
zh_hans: 超长行语法
zh_hk: 超長行語法

source: LSP Not Initialized
zh_hans: LSP 未初始化
zh_hk: LSP 未初始化

source: LSP Service
zh_hans: LSP 服务
zh_hk: LSP 服務

source: Markdown Preview
zh_hans: Markdown 预览
zh_hk: Markdown 預覽

source: Markdown TODO completion
zh_hans: Markdown TODO 完成度
zh_hk: Markdown TODO 完成度

source: match
zh_hans: 个匹配
zh_hk: 個匹配

source: Matched Targets
zh_hans: 匹配的目标
zh_hk: 匹配的目標

source: matches
zh_hans: 个匹配
zh_hk: 個匹配

source: Medium File
zh_hans: 中等文件
zh_hk: 中等檔案

source: Mega File
zh_hans: 超大文件
zh_hk: 超大檔案

source: minimap
zh_hans: 缩略图
zh_hk: 縮略圖

source: Minimap disabled
zh_hans: Minimap 已禁用
zh_hk: Minimap 已禁用

source: Move Line Down
zh_hans: 下移行
zh_hk: 下移行

source: Move Line Up
zh_hans: 上移行
zh_hk: 上移行

source: Move to Trash
zh_hans: 移到废纸篓
zh_hk: 移到垃圾桶

source: Multi-Target Ambiguity
zh_hans: 多目标歧义
zh_hk: 多目標歧義

source: Multi-Target File
zh_hans: 多目标文件
zh_hk: 多目標文件

source: Navigate
zh_hans: 导航
zh_hk: 導航

source: Needs resync
zh_hans: 需要重新同步
zh_hk: 需要重新同步

source: Needs Sync
zh_hans: 需要同步
zh_hk: 需要同步

source: New File
zh_hans: 新建文件
zh_hk: 新增檔案

source: New Folder
zh_hans: 新建文件夹
zh_hk: 新增資料夾

source: New name
zh_hans: 新名称
zh_hk: 新名稱

source: New Terminal
zh_hans: 新建终端
zh_hk: 新建終端

source: No #Preview in the current Swift file.
zh_hans: 当前 Swift 文件中没有 #Preview。
zh_hk: 目前 Swift 檔案中沒有 #Preview。

source: No active editor
zh_hans: 无活动编辑器
zh_hk: 無活動編輯器

source: No applicable edits for this file
zh_hans: 此文件无可应用的编辑
zh_hk: 此檔案無可應用的編輯

source: No Call Hierarchy
zh_hans: 无调用层次
zh_hk: 無調用層次

source: No Changes
zh_hans: 无变更
zh_hk: 無變更

source: No content available
zh_hans: 暂无内容
zh_hk: 暫無內容

source: No content to preview
zh_hans: 没有可预览的内容
zh_hk: 沒有可預覽的內容

source: No CSV content to preview.
zh_hans: 没有 CSV 内容可预览。
zh_hk: 沒有 CSV 內容可預覽。

source: No data rows found
zh_hans: 未找到数据行
zh_hk: 未找到資料列

source: No declaration found
zh_hans: 未找到声明
zh_hk: 未找到聲明

source: No definition found
zh_hans: 未找到定义
zh_hk: 未找到定義

source: No editor context snapshot available.
zh_hans: 没有可用的编辑器上下文快照。
zh_hk: 沒有可用的編輯器上下文快照。

source: No File Open
zh_hans: 没有打开的文件
zh_hk: 沒有打開的文件

source: No HTML content to preview.
zh_hans: 没有 HTML 内容可预览。
zh_hk: 沒有 HTML 內容可預覽。

source: No implementation found
zh_hans: 未找到实现
zh_hk: 未找到實現

source: No JSON content to preview.
zh_hans: 没有 JSON 内容可预览。
zh_hk: 沒有 JSON 內容可預覽。

source: No Markdown content to preview.
zh_hans: 没有 Markdown 内容可预览。
zh_hk: 沒有 Markdown 內容可預覽。

source: No Matching Results
zh_hans: 无匹配结果
zh_hk: 無匹配結果

source: No open terminals
zh_hans: 没有打开的终端
zh_hk: 沒有打開的終端

source: No plist content to preview.
zh_hans: 没有 plist 内容可预览。
zh_hk: 沒有 plist 內容可預覽。

source: No preview available
zh_hans: 无可用预览
zh_hk: 無可用預覽

source: No Problems
zh_hans: 没有问题
zh_hk: 沒有問題

source: No project
zh_hans: 暂无项目
zh_hk: 暫無專案

source: No References
zh_hans: 无引用
zh_hk: 無引用

source: No references found
zh_hans: 未找到引用
zh_hk: 未找到引用

source: No results
zh_hans: 无搜索结果
zh_hk: 無搜索結果

source: No selection to transform
zh_hans: 没有选中内容可转换
zh_hk: 沒有選中內容可轉換

source: No String Catalog content to preview.
zh_hans: 没有字符串目录内容可预览。
zh_hk: 沒有字串目錄內容可預覽。

source: No type definition found
zh_hans: 未找到类型定义
zh_hk: 未找到類型定義

source: None
zh_hans: 无
zh_hk: 無

source: Normal File
zh_hans: 普通文件
zh_hk: 普通檔案

source: Not Detected
zh_hans: 未检测到
zh_hk: 未檢測到

source: Not Initialized
zh_hans: 未初始化
zh_hk: 未初始化

source: Not Selected
zh_hans: 未选择
zh_hk: 未選擇

source: OK
zh_hans: 确定
zh_hk: 確定

source: Open
zh_hans: 打开
zh_hk: 開啟

source: Open a Swift file with a `#Preview`, an image, Markdown, JSON, or String Catalog file to preview it here.
zh_hans: 打开包含 `#Preview` 的 Swift 文件、图片、Markdown、JSON 或字符串目录文件即可在此预览。
zh_hk: 開啟包含 `#Preview` 的 Swift 檔案、圖片、Markdown、JSON 或字串目錄檔案即可在此預覽。

source: Open a Swift file with a `#Preview`; Inline Preview starts automatically and refreshes when you save.
zh_hans: 打开包含 `#Preview` 的 Swift 文件，内嵌预览会自动启动并在保存时刷新。
zh_hk: 開啟包含 `#Preview` 的 Swift 檔案，內嵌預覽會自動啟動並在儲存時重新整理。

source: Open diagnostic
zh_hans: 打开诊断
zh_hk: 開啟診斷

source: Open Editors
zh_hans: 已打开的编辑器
zh_hk: 已開啟的編輯器

source: Open in Terminal
zh_hans: 在终端中打开
zh_hk: 在終端機中開啟

source: Open in VS Code
zh_hans: 在 VS Code 中打开
zh_hk: 在 VS Code 中開啟

source: Open in Xcode
zh_hans: 在 Xcode 中打开
zh_hk: 在 Xcode 中打開

source: Open Repository
zh_hans: 打开仓库
zh_hk: 打開倉庫

source: Open Search Editor
zh_hans: 打开搜索编辑器
zh_hk: 開啟搜索編輯器

source: Organize Imports on Save
zh_hans: 保存时整理导入
zh_hk: 儲存時整理導入

source: Outgoing
zh_hans: 传出调用
zh_hk: 傳出調用

source: Outline
zh_hans: 大纲
zh_hk: 大綱

source: PDF Preview
zh_hans: PDF 预览
zh_hk: PDF 預覽

source: Peek Definition
zh_hans: 查看定义
zh_hk: 查看定義

source: Peek References
zh_hans: 查看引用
zh_hk: 查看引用

source: Pin Tab
zh_hans: 固定标签页
zh_hk: 固定標籤頁

source: Plist Preview
zh_hans: Plist 预览
zh_hk: Plist 預覽

source: Preferred Target
zh_hans: 首选目标
zh_hk: 首選目標

source: Preserve Case
zh_hans: 保留大小写
zh_hk: 保留大小寫

source: Preview
zh_hans: 预览
zh_hk: 預覽

source: Preview Changes
zh_hans: 预览更改
zh_hk: 預覽更改

source: Preview dylib failed to load
zh_hans: 预览 dylib 加载失败
zh_hk: 預覽 dylib 載入失敗

source: Preview failed
zh_hans: 预览失败
zh_hk: 預覽失敗

# Preview Truncated for Large File
source: File is very large, only a partial preview is shown.
zh_hans: 大文件预览已截断
zh_hk: 大文件預覽已截斷

source: Problems
zh_hans: 问题
zh_hk: 問題

source: Problems (%lld)
zh_hans: 问题（%lld）
zh_hk: 問題（%lld）

source: Problems panel in the editor bottom area
zh_hans: 编辑器底部的问题面板
zh_hk: 編輯器底部的問題面板

source: Project
zh_hans: 项目
zh_hk: 項目

source: Project Context
zh_hans: 项目上下文
zh_hk: 項目上下文

source: Project File Tree
zh_hans: 项目文件树
zh_hk: 專案檔案樹

source: Project Files
zh_hans: 项目文件
zh_hk: 專案檔案

source: Project Keys
zh_hans: 项目配置项
zh_hk: 項目配置項

source: Project semantic context is not ready, cross-file semantic capabilities may be unstable.
zh_hans: 项目语义上下文未就绪，跨文件语义能力可能不稳定。
zh_hk: 項目語義上下文未就緒，跨文件語義能力可能不穩定。

source: Provides the core Language Server Protocol integration including completion, hover, and diagnostics.
zh_hans: 提供核心语言服务器协议集成，包括补全、悬停和诊断。
zh_hk: 提供核心語言伺服器協議整合，包括補全、懸停和診斷。

source: Provides Xcode project identity, build context, and sourcekit-lsp integration for Swift projects.
zh_hans: 为 Swift 项目提供 Xcode 项目标识、构建上下文和 sourcekit-lsp 集成。
zh_hk: 為 Swift 項目提供 Xcode 項目標識、構建上下文和 sourcekit-lsp 集成。

source: Quick Fix
zh_hans: 快速修复
zh_hk: 快速修復

source: Quick Open: files, @symbols, #workspace, :line, >commands
zh_hans: 快速打开：文件、@符号、#工作区、:行号、>命令
zh_hk: 快速開啟：檔案、@符號、#工作區、:行號、>命令

source: Re-resolve
zh_hans: 重新解析
zh_hk: 重新解析

source: Re-resolve Build Context
zh_hans: 重新解析构建上下文
zh_hk: 重新解析構建上下文

source: Re-resolving...
zh_hans: 重新解析中...
zh_hk: 重新解析中...

source: ready
zh_hans: 就绪
zh_hk: 就緒

source: Ready
zh_hans: 就绪
zh_hk: 就緒

source: rebuilt
zh_hans: 重新构建
zh_hk: 重新建置

source: Recently Used
zh_hans: 最近使用
zh_hk: 最近使用

source: Redo
zh_hans: 重做
zh_hk: 重做

source: Reference
zh_hans: 引用
zh_hk: 引用

source: References
zh_hans: 引用
zh_hk: 引用

source: References (%lld)
zh_hans: 引用（%lld）
zh_hk: 引用（%lld）

source: References panel in the editor bottom area
zh_hans: 编辑器底部的引用面板
zh_hk: 編輯器底部的引用面板

source: Refresh entry debug state
zh_hans: 刷新入口调试状态
zh_hk: 重新整理入口除錯狀態

source: Reload from Disk
zh_hans: 从磁盘重新加载
zh_hk: 從磁碟重新載入

source: Remove Last Occurrence
zh_hans: 移除上一个匹配项
zh_hk: 移除上一個匹配項

source: Remove Last Occurrence Selection
zh_hans: 移除上一个匹配项选区
zh_hk: 移除上一個匹配項選區

source: Rename
zh_hans: 重命名
zh_hk: 重命名

source: Rename cancelled
zh_hans: 重命名已取消
zh_hk: 重命名已取消

source: Rename completed, updated files:
zh_hans: 重命名完成，已更新文件：
zh_hk: 重命名完成，已更新文件：

source: Rename failed
zh_hans: 重命名失败
zh_hk: 重命名失敗

source: Rename not applied
zh_hans: 重命名未应用
zh_hk: 重命名未應用

source: Rename Symbol
zh_hans: 重命名符号
zh_hk: 重命名符號

source: Renaming symbol...
zh_hans: 正在重命名符号...
zh_hk: 正在重命名符號...

source: Replace
zh_hans: 替换
zh_hk: 替換

source: Replace All
zh_hans: 全部替换
zh_hk: 全部替換

source: Resolving build context...
zh_hans: 正在解析构建上下文...
zh_hk: 正在解析構建上下文...

source: Resolving...
zh_hans: 解析中...
zh_hk: 解析中...

source: Retry
zh_hans: 重试
zh_hk: 重試

source: Retry preview build
zh_hans: 重试预览构建
zh_hk: 重試預覽建置

source: Reveal in Finder
zh_hans: 在 Finder 中显示
zh_hk: 在 Finder 中顯示

source: Run
zh_hans: 运行
zh_hk: 運行

source: Run go build to see output
zh_hans: 运行 go build 查看输出
zh_hk: 執行 go build 查看輸出

source: Run go test to see results
zh_hans: 运行 go test 查看结果
zh_hk: 執行 go test 查看結果

source: running · %@
zh_hans: 运行中 · %@
zh_hk: 執行中 · %@

source: Save
zh_hans: 保存
zh_hk: 儲存

source: Saved
zh_hans: 已保存
zh_hk: 已保存

source: Saving...
zh_hans: 保存中...
zh_hk: 保存中...

source: Scheme Does Not Cover File Target
zh_hans: Scheme 未覆盖文件所在目标
zh_hk: Scheme 未覆蓋文件所在目標

source: Scheme Targets
zh_hans: Scheme 目标
zh_hk: Scheme 目標

source: Screenshot preview canvas
zh_hans: 截取预览画布
zh_hk: 擷取預覽畫布

source: Screenshot saved to Desktop and copied to clipboard: %@
zh_hans: 截图已保存到桌面并复制到剪贴板：%@
zh_hk: 截圖已儲存到桌面並複製到剪貼簿：%@

source: SDK resolution failed
zh_hans: SDK 解析失败
zh_hk: SDK 解析失敗

source: Search
zh_hans: 搜索
zh_hk: 搜索

source: Search in files
zh_hans: 在文件中搜索
zh_hk: 在檔案中搜索

source: Search in Files
zh_hans: 在文件中搜索
zh_hk: 在檔案中搜索

source: Search panel in the editor bottom area
zh_hans: 编辑器底部的搜索面板
zh_hk: 編輯器底部的搜索面板

source: Searching workspace…
zh_hans: 正在搜索工作区…
zh_hk: 正在搜索工作區…

source: Select a file to start editing
zh_hans: 选择文件开始编辑
zh_hk: 選擇文件開始編輯

source: Select All Occurrences
zh_hans: 选择所有匹配项
zh_hk: 選擇所有匹配項

source: semantic
zh_hans: 语义标记
zh_hk: 語義標記

source: Semantic Availability
zh_hans: 语义可用性
zh_hk: 語義可用性

source: Semantic tokens disabled
zh_hans: 语义标记已禁用
zh_hk: 語義標記已禁用

source: Show Call Hierarchy
zh_hans: 显示调用层级
zh_hk: 顯示調用層級

source: Show entry debug state
zh_hans: 显示入口调试状态
zh_hk: 顯示入口除錯狀態

source: Show error details
zh_hans: 显示错误详情
zh_hk: 顯示錯誤詳情

source: Show log file in Finder
zh_hans: 在 Finder 中显示日志文件
zh_hk: 在 Finder 中顯示日誌檔案

source: Show project file directory structure
zh_hans: 显示当前项目的树状文件目录结构
zh_hk: 顯示當前專案的樹狀檔案目錄結構

source: Sort Lines Ascending
zh_hans: 行升序排列
zh_hk: 行升序排列

source: Sort Lines Descending
zh_hans: 行降序排列
zh_hk: 行降序排列

source: Split Editor Down
zh_hans: 向下分栏
zh_hk: 向下分欄

source: Split Editor Right
zh_hans: 向右分栏
zh_hk: 向右分欄

source: starting
zh_hans: 启动中
zh_hk: 啟動中

source: stopping
zh_hans: 停止中
zh_hk: 停止中

source: String Catalog Preview
zh_hans: 字符串目录预览
zh_hk: 字串目錄預覽

source: Swift semantic indexing in progress
zh_hans: Swift 语义索引进行中
zh_hk: Swift 語義索引進行中

source: Syntax highlighting limit: first %@ lines
zh_hans: 语法高亮限制：前 %@ 行
zh_hk: 語法高亮限制：前 %@ 行

source: Tab (↹)
zh_hans: 制表符 (↹)
zh_hk: 製表符 (↹)

source: Tab bar and breadcrumb for the editor panel
zh_hans: 编辑器面板的标签栏和面包屑导航
zh_hk: 編輯器面板的標籤欄和麵包屑導航

source: Tab bar for the editor panel
zh_hans: 编辑器面板的标签栏
zh_hk: 編輯器面板的標籤欄

source: Target platform for current editor semantic context
zh_hans: 当前编辑器语义上下文的目标平台
zh_hk: 當前編輯器語義上下文的目標平台

source: Terminal
zh_hans: 终端
zh_hk: 終端

source: Terminal panel in the editor bottom area
zh_hans: 编辑器底部的终端面板
zh_hk: 編輯器底部的終端面板

source: Tests
zh_hans: 测试
zh_hk: 測試

source: The current build context has expired, workspace semantic results may be inaccurate.
zh_hans: 当前构建上下文已过期，工作区语义结果可能不准确。
zh_hk: 當前構建上下文已過期，工作區語義結果可能不準確。

source: The current target platform has not yet been resolved.
zh_hans: 当前目标平台尚未解析。
zh_hk: 當前目標平台尚未解析。

source: The current Xcode project context has not yet completed initialization.
zh_hans: 当前 Xcode 项目上下文尚未完成初始化。
zh_hk: 當前 Xcode 項目上下文尚未完成初始化。
